refine: 添加对 focus 路由和样式渲染的支持
